handsome666-c/ps-g/ps_g1/firmware/n32g05x_std_periph_driver/src/n32g05x_gpio.c
                /* Clear EXTI line configuration */
                EXTI->IMASK &= ~((uint32_t)currentpin);
                EXTI->EMASK &= ~((uint32_t)currentpin);

                /* Clear Rising Falling edge configuration */
                EXTI->RT_CFG &= ~((uint32_t)currentpin);
                EXTI->FT_CFG &= ~((uint32_t)currentpin);
            }
        } 
        pos++;
    }
}

/**
 *\*\name   GPIO_AFIOInitDefault.
 *\*\fun    Reset the AFIO peripheral registers to their default reset values.
 *\*\param  none
 *\*\return none
 */
void GPIO_AFIOInitDefault(void)
{
    RCC_EnableAPB2PeriphReset(RCC_APB2_PERIPH_AFIO);
}


/**
 *\*\name   GPIO_InitPeripheral.
 *\*\fun    Initialize the GPIOx peripheral with the value of the GPIO_InitStruct structure.
 *\*\param  GPIOx :
 *\*\          - GPIOA
 *\*\          - GPIOB
 *\*\          - GPIOC
 *\*\          - GPIOD
 *\*\param  GPIO_InitStructure :
 *\*\            - pin
 *\*\               - GPIO_PIN_0
 *\*\               - GPIO_PIN_1
 *\*\               - GPIO_PIN_2
 *\*\               - GPIO_PIN_3
 *\*\               - GPIO_PIN_4
 *\*\               - GPIO_PIN_5
 *\*\               - GPIO_PIN_6
 *\*\               - GPIO_PIN_7
 *\*\               - GPIO_PIN_8
 *\*\               - GPIO_PIN_9
 *\*\               - GPIO_PIN_10
 *\*\               - GPIO_PIN_11
 *\*\               - GPIO_PIN_12
 *\*\               - GPIO_PIN_13
 *\*\               - GPIO_PIN_14
 *\*\               - GPIO_PIN_15
 *\*\               - GPIO_PIN_ALL
 *\*\            - GPIO_Mode
 *\*\               - GPIO_MODE_INPUT
 *\*\               - GPIO_MODE_OUTPUT_PP
 *\*\               - GPIO_MODE_OUTPUT_OD
 *\*\               - GPIO_MODE_AF_PP
 *\*\               - GPIO_MODE_AF_OD
 *\*\               - GPIO_MODE_ANALOG
 *\*\            - GPIO_Pull
 *\*\               - GPIO_NO_PULL
 *\*\               - GPIO_PULL_UP
 *\*\               - GPIO_PULL_DOWN
 *\*\            - GPIO_Slew_Rate
 *\*\               - GPIO_SLEW_RATE_FAST
 *\*\               - GPIO_SLEW_RATE_SLOW
 *\*\            - GPIO_Current
 *\*\               - GPIO_HIGH_DREIVE
 *\*\               - GPIO_LOW_DREIVE
 *\*\            - GPIO_Alternate
 *\*\               - GPIO_AF0_SWDIO        SWDIO Alternate Function mapping
 *\*\               - GPIO_AF0_SWCLK        SWCLK Alternate Function mapping
 *\*\               - GPIO_AF0_TIM1         TIM1 Alternate Function mapping 
 *\*\               - GPIO_AF0_TIM3         TIM3 Alternate Function mapping 
 *\*\               - GPIO_AF0_SPI1         SPI1 Alternate Function mapping 
 *\*\               - GPIO_AF0_SPI2         SPI2 Alternate Function mapping 
 *\*\               - GPIO_AF0_SPI3         SPI3 Alternate Function mapping 
 *\*\               - GPIO_AF0_RCI1         RCI1 Alternate Function mapping 
 *\*\               - GPIO_AF0_I2C2         I2C2 Alternate Function mapping 
 *\*\               - GPIO_AF1_TIM1         TIM1 Alternate Function mapping
 *\*\               - GPIO_AF1_TIM2         TIM2 Alternate Function mapping
 *\*\               - GPIO_AF1_TIM3         TIM3 Alternate Function mapping
 *\*\               - GPIO_AF1_TIM4         TIM4 Alternate Function mapping
 *\*\               - GPIO_AF1_TIM5         TIM5 Alternate Function mapping
 *\*\               - GPIO_AF1_I2C1         I2C1 Alternate Function mapping
 *\*\               - GPIO_AF1_SPI1         SPI1 Alternate Function mapping
 *\*\               - GPIO_AF1_SPI2         SPI2 Alternate Function mapping
 *\*\               - GPIO_AF1_RCI2         RCI2 Alternate Function mapping
 *\*\               - GPIO_AF2_UART1        UART1 Alternate Function mapping    
 *\*\               - GPIO_AF2_UART2        UART2 Alternate Function mapping    
 *\*\               - GPIO_AF2_TIM1         TIM1 Alternate Function mapping     
 *\*\               - GPIO_AF2_TIM2         TIM2 Alternate Function mapping     
 *\*\               - GPIO_AF2_TIM3         TIM3 Alternate Function mapping     
 *\*\               - GPIO_AF2_TIM4         TIM4 Alternate Function mapping     
 *\*\               - GPIO_AF2_TIM5         TIM5 Alternate Function mapping     
 *\*\               - GPIO_AF2_I2C2         I2C2 Alternate Function mapping     
 *\*\               - GPIO_AF2_RCI2         RCI2 Alternate Function mapping     
 *\*\               - GPIO_AF3_EVENTOUT     EVENTOUT Alternate Function mapping 
 *\*\               - GPIO_AF3_TIM1         TIM1 Alternate Function mapping     
 *\*\               - GPIO_AF3_TIM4         TIM4 Alternate Function mapping     
 *\*\               - GPIO_AF3_TIM5         TIM5 Alternate Function mapping     
 *\*\               - GPIO_AF3_SPI3         SPI3 Alternate Function mapping     
 *\*\               - GPIO_AF3_I2C2         I2C2 Alternate Function mapping     
 *\*\               - GPIO_AF3_RTC          RTC  Alternate Function mapping     
 *\*\               - GPIO_AF3_UART2        UART2 Alternate Function mapping    
 *\*\               - GPIO_AF4_TIM1         TIM1 Alternate Function mapping      
 *\*\               - GPIO_AF4_TIM2         TIM2 Alternate Function mapping     
 *\*\               - GPIO_AF4_TIM3         TIM3 Alternate Function mapping     
 *\*\               - GPIO_AF4_TIM4         TIM4 Alternate Function mapping     
 *\*\               - GPIO_AF4_TIM5         TIM5 Alternate Function mapping     
 *\*\               - GPIO_AF4_SPI2         SPI2 Alternate Function mapping     
 *\*\               - GPIO_AF4_SPI3         SPI3 Alternate Function mapping     
 *\*\               - GPIO_AF4_UART1        UART1 Alternate Function mapping    
 *\*\               - GPIO_AF4_UART2        UART2 Alternate Function mapping    
 *\*\               - GPIO_AF4_UART3        UART3 Alternate Function mapping    
 *\*\               - GPIO_AF4_UART4        UART4 Alternate Function mapping    
 *\*\               - GPIO_AF4_UART5        UART5 Alternate Function mapping    
 *\*\               - GPIO_AF4_I2C2         I2C2 Alternate Function mapping     
 *\*\               - GPIO_AF4_CAN          CAN  Alternate Function mapping     
 *\*\               - GPIO_AF4_COMP4        COMP4 Alternate Function mapping    
 *\*\               - GPIO_AF4_RTC          RTC Alternate Function mapping      
 *\*\               - GPIO_AF4_EVENTOUT     EVENTOUT Alternate Function mapping 
 *\*\               - GPIO_AF5_UART1        UART1 Alternate Function mapping    
 *\*\               - GPIO_AF5_UART3        UART3 Alternate Function mapping    
 *\*\               - GPIO_AF5_UART4        UART4 Alternate Function mapping    
 *\*\               - GPIO_AF5_UART5        UART5 Alternate Function mapping    
 *\*\               - GPIO_AF5_TIM1         TIM1 Alternate Function mapping     
 *\*\               - GPIO_AF5_TIM5         TIM5 Alternate Function mapping     
 *\*\               - GPIO_AF5_SPI1         SPI1 Alternate Function mapping     
 *\*\               - GPIO_AF5_SPI2         SPI2 Alternate Function mapping     
 *\*\               - GPIO_AF5_SPI3         SPI3 Alternate Function mapping     
 *\*\               - GPIO_AF5_RCI1         RCI1 Alternate Function mapping     
 *\*\               - GPIO_AF5_COMP1        COMP1 Alternate Function mapping    
 *\*\               - GPIO_AF5_COMP3        COMP3 Alternate Function mapping    
 *\*\               - GPIO_AF5_COMP4        COMP4 Alternate Function mapping    
 *\*\               - GPIO_AF5_I2C2         I2C2  Alternate Function mapping    
 *\*\               - GPIO_AF6_I2C2         I2C2 Alternate Function mapping     
 *\*\               - GPIO_AF6_I2C1         I2C1 Alternate Function mapping     
 *\*\               - GPIO_AF6_UART2        UART2 Alternate Function mapping    
 *\*\               - GPIO_AF6_UART3        UART3 Alternate Function mapping    
 *\*\               - GPIO_AF6_UART5        UART5 Alternate Function mapping    
 *\*\               - GPIO_AF6_MCO          MCO Alternate Function mapping      
 *\*\               - GPIO_AF6_SPI3         SPI3  Alternate Function mapping    
 *\*\               - GPIO_AF6_COMP2        COMP2 Alternate Function mapping    
 *\*\               - GPIO_AF6_RCI1         RCI1 Alternate Function mapping     
 *\*\               - GPIO_AF6_BEEPER       BEEPER Alternate Function mapping   
 *\*\               - GPIO_AF7_BEEPER       BEEPER Alternate Function mapping   
 *\*\               - GPIO_AF7_I2C1         I2C1 Alternate Function mapping     
 *\*\               - GPIO_AF7_I2C2         I2C2 Alternate Function mapping     
 *\*\               - GPIO_AF7_UART4        UART4 Alternate Function mapping    
 *\*\               - GPIO_AF7_RTC          RTC  Alternate Function mapping     
 *\*\               - GPIO_AF7_CAN          CAN  Alternate Function mapping     
 *\*\               - GPIO_AF7_TIM1         TIM1 Alternate Function mapping     
 *\*\               - GPIO_AF7_RCI2         RCI2 Alternate Function mapping     
 *\*\               - GPIO_AF8_SPI3         SPI3 Alternate Function mapping     
 *\*\               - GPIO_AF8_I2C1         I2C1 Alternate Function mapping     
 *\*\               - GPIO_AF8_RCI2         RCI2 Alternate Function mapping     
 *\*\               - GPIO_AF8_UART4        UART4 Alternate Function mapping    
 *\*\               - GPIO_AF8_UART5        UART5 Alternate Function mapping    
 *\*\               - GPIO_AF8_CAN          CAN   Alternate Function mapping    
 *\*\               - GPIO_AF8_COMP1        COMP1 Alternate Function mapping    
 *\*\               - GPIO_AF8_COMP3        COMP3 Alternate Function mapping    
 *\*\               - GPIO_AF8_COMP4        COMP4 Alternate Function mapping    
 *\*\               - GPIO_AF9_COMP2        COMP2 Alternate Function mapping    
 *\*\               - GPIO_AF9_COMP3        COMP3 Alternate Function mapping    
 *\*\               - GPIO_AF9_RCI2         RCI2 Alternate Function mapping     
 *\*\               - GPIO_AF10_RCI2        RCI2 Alternate Function mapping    
 *\*\               - GPIO_NO_AF            NO alternate Function mapping
 *\*\return none
 */
void GPIO_InitPeripheral(GPIO_Module* GPIOx, GPIO_InitType * GPIO_InitStruct)
{
    uint32_t pos = 0x00U, currentpin;
    uint32_t tmpregister; 

    while(((GPIO_InitStruct->Pin) >> pos) != 0)
    {
        /* Get the IO position */
        currentpin = (GPIO_InitStruct->Pin) & ((uint32_t)1U << pos);

        if(currentpin > 0)
        {
            /*--------------------- GPIO Mode Configuration ------------------------*/
            /* In case of Alternate function mode selection */
            if((GPIO_InitStruct->GPIO_Mode == GPIO_MODE_AF_PP) || (GPIO_InitStruct->GPIO_Mode == GPIO_MODE_AF_OD) || ((GPIO_InitStruct->GPIO_Mode == GPIO_MODE_ANALOG) && (GPIO_InitStruct->GPIO_Alternate != GPIO_NO_AF)))
            {
                /* Configure Alternate function mapped with the current IO */
                if((pos & (uint8_t)0x08) > 0)
                {
                    tmpregister = GPIOx->AFH;
                    tmpregister &= ~((uint32_t)0xF << ((uint32_t)(pos & (uint32_t)0x07) * 4U));
                    tmpregister |= ((uint32_t)(GPIO_InitStruct->GPIO_Alternate) << ((uint32_t)(pos & (uint32_t)0x07) * 4U)) ;
                    GPIOx->AFH = tmpregister;
                }
                else
                {
                    tmpregister = GPIOx->AFL;
                    tmpregister &= ~((uint32_t)0xF << ((uint32_t)(pos & (uint32_t)0x07) * 4U)) ;
                    tmpregister |= ((uint32_t)(GPIO_InitStruct->GPIO_Alternate) << ((uint32_t)(pos & (uint32_t)0x07) * 4U)) ;
                    GPIOx->AFL = tmpregister;
                }
            }

            /* In case of Output or Alternate function mode selection */
            if ((GPIO_InitStruct->GPIO_Mode == GPIO_MODE_OUTPUT_PP) || (GPIO_InitStruct->GPIO_Mode == GPIO_MODE_OUTPUT_OD)
                 ||(GPIO_InitStruct->GPIO_Mode == GPIO_MODE_AF_PP) || (GPIO_InitStruct->GPIO_Mode == GPIO_MODE_AF_OD))
            {
                /* Configure the IO Output Type */
                tmpregister = GPIOx->POTYPE;
                tmpregister &= ~(GPIO_POTYPE_POT0 << pos);
                tmpregister |= (((GPIO_InitStruct->GPIO_Mode >> 4U) & 0x01U) << pos);
                GPIOx->POTYPE = tmpregister;
            }

            /*---------------------------- GPIO Mode Configuration -----------------------*/
            /* Configure IO Direction mode (Input, Output, Alternate or Analog) */
            tmpregister = GPIOx->PMODE;
            tmpregister &= ~(GPIO_PMODE0 << (pos * 2U));
            tmpregister |= (((GPIO_InitStruct->GPIO_Mode & 0x03U) << (pos * 2U)));
            GPIOx->PMODE = tmpregister;

            /* Configure pull-down mode */
            tmpregister = GPIOx->PUPD;
            tmpregister &= ~(GPIO_PUPD0 << (pos * 2U));
            tmpregister |= (GPIO_InitStruct->GPIO_Pull << (pos * 2U));
            GPIOx->PUPD = tmpregister;

            /* Configure slew rate */
            tmpregister = GPIOx->SR;
            tmpregister &= ~(GPIO_SR_SR0 << pos);
            tmpregister |= (GPIO_InitStruct->GPIO_Slew_Rate << pos);
            GPIOx->SR = tmpregister;

