handsome666-c/ps-g/ps_g1/firmware/n32g05x_std_periph_driver/src/n32g05x_gpio.c
    temp_value = AFIO->CFG;
    
    temp_value &= ~AFIO_RMP_CFG_IOFLITCFG;

    AFIO->CFG = (temp_value | Flit_Num);
}

/**
 *\*\name   AFIO_DIGEFTEnable.
 *\*\fun    Enables or disable digital EFT of port pins.
 *\*\param  PortSource :
 *\*\          - GPIOA_PORT_SOURCE
 *\*\          - GPIOB_PORT_SOURCE
 *\*\          - GPIOC_PORT_SOURCE
 *\*\          - GPIOD_PORT_SOURCE
 *\*\param  Pin :
 *\*\          - GPIO_PIN_0
 *\*\          - GPIO_PIN_1
 *\*\          - GPIO_PIN_2
 *\*\          - GPIO_PIN_3
 *\*\          - GPIO_PIN_4
 *\*\          - GPIO_PIN_5
 *\*\          - GPIO_PIN_6
 *\*\          - GPIO_PIN_7
 *\*\          - GPIO_PIN_8
 *\*\          - GPIO_PIN_9
 *\*\          - GPIO_PIN_10
 *\*\          - GPIO_PIN_11
 *\*\          - GPIO_PIN_12
 *\*\          - GPIO_PIN_13
 *\*\          - GPIO_PIN_14
 *\*\          - GPIO_PIN_15
 *\*\          - GPIO_PIN_ALL
 *\*\param  Cmd :
 *\*\          - ENABLE
 *\*\          - DISABLE
 *\*\return none
 */
void AFIO_DIGEFTEnable(uint8_t PortSource, uint16_t Pin, FunctionalState Cmd)
{
    uint32_t pin = (uint32_t)Pin;

    if(PortSource < GPIOC_PORT_SOURCE)
    {
        if(Cmd == ENABLE)
        {
            AFIO->DIGEFT_CFG1 |= (pin<<(PortSource*16));
        }
        else
        {
            AFIO->DIGEFT_CFG1 &= ~(pin<<(PortSource*16));
        }
    }
    else
    {
        if(Cmd == ENABLE)
        {
            AFIO->DIGEFT_CFG2 |= (pin << ((PortSource & (uint8_t)0x01)*16));
        }
            
        else
        {
            AFIO->DIGEFT_CFG2 &= (pin << ((PortSource & (uint8_t)0x01)*16));
        }
    }
}
